package com.ohgiraffers.section03.interfaceimplements;

public interface IConnectable {

    /*
    * [인터페이스]
    * 클래스가 반드시 구현해야 할 기능의 규칙을 정의한다
    *
    * - interface 키워드로 선언
    * - 직접 객체를 생성할 수 없음
    * - 클래스는 implements로 인터페이스를 구현
    * - 구현 클래스는 추상 메소드를 반드시 오버라이딩 해야함
    * - 인터페이스 타입으로 구현 객체를 참조할 수 있음(다형성)
    * - 여러 인터페이스를 동시에 구현할 수 있음 - 상속은 하나밖에 못받음
    * */

    // 키보드와 마우스는 서로 다른 장치 - but 컴퓨터에 연결하거나 연결을 해지할 수 있어야함
    // 컴퓨터에 장치별로 연결하는 메소드를 만들면 마이크, 헤드폰같은 장치들이 추가될때마다 컴퓨터 클래스에 메소드를 추가해줘야함
    // 따라서 컴퓨터에 연결한다.헤제한다. 같은 기능만 넣음 - 인터페이스에 연결규격,규칙(기능,규격)

    // 인터페이스 -> 상속X 구현 O.

//    public void connect() {} - 추상 메서드는 메서드 본문 사용 못함

    // 몸체가 없는 추상 클래스 만듬
    public abstract void connect(); // public abstract 명시적으로 적어줌

    // 인터페이스의 추상 메서드에는 public abstract가 자동으로 적용된다
    void disconnect();

    /*
    * 추상 클래스 : 공통 속성과 기능을 물려주는 미완성 부모 클래스
    * 인터페이스: 구현 클래스가 지켜야 할 기능의 약속
    * */
}
